Ran Plan for 3 projects:

1. project: `secondary-us-east-1-iam` dir: `live/secondary-account/us-east-1/iam` workspace: `default`
1. project: `secondary-us-east-1-eks-cluster` dir: `live/secondary-account/us-east-1/eks-cluster` workspace: `default`
1. project: `main-us-east-1-argocd` dir: `live/main-account/us-east-1/argocd` workspace: `default`
---

### 1. project: `secondary-us-east-1-iam` dir: `live/secondary-account/us-east-1/iam` workspace: `default`
<details><summary>Show Output</summary>

```diff
01:11:29.625 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
01:11:29.658 INFO   Downloading Terraform configurations from ../../../../modules/iam into ./.terragrunt-cache/gKP4GvC9iv1QwSnIaxMmPW8QdKc/6dT4-4AJOd8_Rhjk_0uxdMePAmc
01:11:29.694 INFO   terraform: Initializing the backend...
01:11:29.795 INFO   terraform: Successfully configured the backend "s3"! Terraform will automatically
01:11:29.795 INFO   terraform: use this backend unless the backend configuration changes.
01:11:29.873 INFO   terraform: Initializing provider plugins...
01:11:29.873 INFO   terraform: - Finding hashicorp/aws versions matching "~> 6.0"...
01:11:30.006 INFO   terraform: - Installing hashicorp/aws v6.35.0...
01:11:37.758 INFO   terraform: - Installed hashicorp/aws v6.35.0 (signed by HashiCorp)
01:11:37.758 INFO   terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
01:11:37.758 INFO   terraform: selections it made above. Include this file in your version control repository
01:11:37.758 INFO   terraform: so that Terraform can guarantee to make the same selections by default when
01:11:37.758 INFO   terraform: you run "terraform init" in the future.
01:11:37.758 INFO   terraform: Terraform has been successfully initialized!
01:11:37.758 INFO   terraform: You may now begin working with Terraform. Try running "terraform plan" to see
01:11:37.758 INFO   terraform: any changes that are required for your infrastructure. All Terraform commands
01:11:37.759 INFO   terraform: should now work.
01:11:37.759 INFO   terraform: If you ever set or change modules or backend configuration for Terraform,
01:11:37.759 INFO   terraform: rerun this command to reinitialize your working directory. If you forget, other
01:11:37.759 INFO   terraform: commands will detect it and remind you to do so if necessary.
01:11:43.277 STDOUT terraform: data.aws_caller_identity.current: Reading...
01:11:43.277 STDOUT terraform: data.aws_iam_policy_document.argocd_spoke_permissions[0]: Reading...
01:11:43.277 STDOUT terraform: data.aws_iam_policy_document.argocd_spoke_assume_role[0]: Reading...
01:11:43.277 STDOUT terraform: data.aws_iam_policy_document.sagemaker_assume_role[0]: Reading...
01:11:43.277 STDOUT terraform: data.aws_iam_policy_document.hyperpod_karpenter_assume_role[0]: Reading...
01:11:43.280 STDOUT terraform: data.aws_iam_policy_document.argocd_spoke_permissions[0]: Read complete after 0s [id=129909284]
01:11:43.280 STDOUT terraform: data.aws_iam_policy_document.sagemaker_assume_role[0]: Read complete after 0s [id=1147345228]
01:11:43.280 STDOUT terraform: data.aws_iam_policy_document.hyperpod_karpenter_assume_role[0]: Read complete after 0s [id=3000541199]
01:11:43.280 STDOUT terraform: data.aws_iam_policy_document.argocd_spoke_assume_role[0]: Read complete after 0s [id=3606493382]
01:11:43.284 STDOUT terraform: aws_iam_role.hyperpod_execution[0]: Refreshing state... [id=HyperPodExecutionRole]
01:11:43.284 STDOUT terraform: aws_iam_role.hyperpod_karpenter[0]: Refreshing state... [id=SageMakerHyperPodKarpenterRole]
01:11:43.284 STDOUT terraform: data.aws_caller_identity.current: Read complete after 0s [id=159553542841]
01:11:43.289 STDOUT terraform: data.aws_iam_policy_document.kms_key_policy: Reading...
01:11:43.289 STDOUT terraform: data.aws_iam_policy_document.hyperpod_karpenter[0]: Reading...
01:11:43.292 STDOUT terraform: data.aws_iam_policy_document.hyperpod_karpenter[0]: Read complete after 0s [id=3342011569]
01:11:43.292 STDOUT terraform: data.aws_iam_policy_document.kms_key_policy: Read complete after 0s [id=4187320566]
01:11:43.295 STDOUT terraform: aws_kms_key.shared: Refreshing state... [id=15e514b2-2f48-4771-a508-5ed4682c9222]
01:11:43.365 STDOUT terraform: aws_kms_alias.shared: Refreshing state... [id=alias/ml-secondary-us-east-1]
01:11:43.368 STDOUT terraform: data.aws_iam_policy_document.hyperpod_execution[0]: Reading...
01:11:43.371 STDOUT terraform: data.aws_iam_policy_document.hyperpod_execution[0]: Read complete after 0s [id=3542945328]
01:11:43.410 STDOUT terraform: aws_iam_role_policy.hyperpod_karpenter[0]: Refreshing state... [id=SageMakerHyperPodKarpenterRole:SageMakerHyperPodKarpenterPolicy]
01:11:43.422 STDOUT terraform: aws_iam_role_policy_attachment.hyperpod_execution_sagemaker[0]: Refreshing state... [id=HyperPodExecutionRole/arn:aws:iam::aws:policy/AmazonSageMakerClusterInstanceRolePolicy]
01:11:43.423 STDOUT terraform: aws_iam_role_policy.hyperpod_execution[0]: Refreshing state... [id=HyperPodExecutionRole:HyperPodExecutionPolicy]
01:11:43.671 STDOUT terraform: Terraform used the selected providers to generate the following execution
01:11:43.671 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
01:11:43.672 STDOUT terraform:   + create
01:11:43.672 STDOUT terraform: Terraform will perform the following actions:
01:11:43.672 STDOUT terraform:   # aws_iam_role.argocd_spoke_access[0] will be created
01:11:43.672 STDOUT terraform:   + resource "aws_iam_role" "argocd_spoke_access" {
01:11:43.672 STDOUT terraform:       + arn                   = (known after apply)
01:11:43.672 STDOUT terraform:       + assume_role_policy    = jsonencode(
01:11:43.672 STDOUT terraform:             {
01:11:43.672 STDOUT terraform:               + Statement = [
01:11:43.672 STDOUT terraform:                   + {
01:11:43.672 STDOUT terraform:                       + Action    = "sts:AssumeRole"
01:11:43.672 STDOUT terraform:                       + Effect    = "Allow"
01:11:43.672 STDOUT terraform:                       + Principal = {
01:11:43.672 STDOUT terraform:                           + AWS = "arn:aws:iam::483026362307:role/ArgoCD-Hub-Controller"
01:11:43.672 STDOUT terraform:                         }
01:11:43.672 STDOUT terraform:                     },
01:11:43.672 STDOUT terraform:                 ]
01:11:43.672 STDOUT terraform:               + Version   = "2012-10-17"
01:11:43.672 STDOUT terraform:             }
01:11:43.672 STDOUT terraform:         )
01:11:43.672 STDOUT terraform:       + create_date           = (known after apply)
01:11:43.672 STDOUT terraform:       + force_detach_policies = false
01:11:43.672 STDOUT terraform:       + id                    = (known after apply)
01:11:43.672 STDOUT terraform:       + managed_policy_arns   = (known after apply)
01:11:43.672 STDOUT terraform:       + max_session_duration  = 3600
01:11:43.672 STDOUT terraform:       + name                  = "ArgoCD-Spoke-Access"
01:11:43.673 STDOUT terraform:       + name_prefix           = (known after apply)
01:11:43.673 STDOUT terraform:       + path                  = "/"
01:11:43.673 STDOUT terraform:       + tags_all              = {
01:11:43.673 STDOUT terraform:           + "Account"    = "secondary"
01:11:43.673 STDOUT terraform:           + "ManagedBy"  = "terraform"
01:11:43.673 STDOUT terraform:           + "Region"     = "us-east-1"
01:11:43.673 STDOUT terraform:           + "Repository" = "ml-clusters"
01:11:43.673 STDOUT terraform:         }
01:11:43.673 STDOUT terraform:       + unique_id             = (known after apply)
01:11:43.673 STDOUT terraform:       + inline_policy (known after apply)
01:11:43.673 STDOUT terraform:     }
01:11:43.673 STDOUT terraform:   # aws_iam_role_policy.argocd_spoke_access[0] will be created
01:11:43.673 STDOUT terraform:   + resource "aws_iam_role_policy" "argocd_spoke_access" {
01:11:43.673 STDOUT terraform:       + id          = (known after apply)
01:11:43.673 STDOUT terraform:       + name        = "ArgoCD-Spoke-Access-Policy"
01:11:43.673 STDOUT terraform:       + name_prefix = (known after apply)
01:11:43.673 STDOUT terraform:       + policy      = jsonencode(
01:11:43.673 STDOUT terraform:             {
01:11:43.673 STDOUT terraform:               + Statement = [
01:11:43.673 STDOUT terraform:                   + {
01:11:43.673 STDOUT terraform:                       + Action   = [
01:11:43.673 STDOUT terraform:                           + "eks:ListClusters",
01:11:43.673 STDOUT terraform:                           + "eks:DescribeCluster",
01:11:43.673 STDOUT terraform:                         ]
01:11:43.673 STDOUT terraform:                       + Effect   = "Allow"
01:11:43.673 STDOUT terraform:                       + Resource = "*"
01:11:43.673 STDOUT terraform:                       + Sid      = "EKSDescribeCluster"
01:11:43.673 STDOUT terraform:                     },
01:11:43.673 STDOUT terraform:                 ]
01:11:43.673 STDOUT terraform:               + Version   = "2012-10-17"
01:11:43.673 STDOUT terraform:             }
01:11:43.673 STDOUT terraform:         )
01:11:43.673 STDOUT terraform:       + role        = (known after apply)
01:11:43.673 STDOUT terraform:     }
01:11:43.673 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.
01:11:43.673 STDOUT terraform: Changes to Outputs:
01:11:43.673 STDOUT terraform:   + argocd_spoke_access_role_arn       = (known after apply)
01:11:43.674 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
01:11:43.674 STDOUT terraform: Saved the plan to:
01:11:43.674 STDOUT terraform: ./secondary-us-east-1-iam-default.tfplan
01:11:43.674 STDOUT terraform: To perform exactly these actions, run the following command to apply:
01:11:43.674 STDOUT terraform:     terraform apply "./secondary-us-east-1-iam-default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p secondary-us-east-1-iam
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.mlkeita.people.aws.dev/lock?id=KeitaW%252Fml-clusters%252Flive%252Fsecondary-account%252Fus-east-1%252Fiam%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p secondary-us-east-1-iam
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 2. project: `secondary-us-east-1-eks-cluster` dir: `live/secondary-account/us-east-1/eks-cluster` workspace: `default`
<details><summary>Show Output</summary>

```diff
01:11:44.317 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
01:12:00.923 INFO   Downloading Terraform configurations from ../../../../modules/eks-cluster into ./.terragrunt-cache/NM20-E0rRiKHUp1AA66CvuUKf4M/9CSR_pFMP5jWVQ5OWN98FJDk5vc
01:12:00.958 INFO   terraform: Initializing the backend...
01:12:01.063 INFO   terraform: Successfully configured the backend "s3"! Terraform will automatically
01:12:01.063 INFO   terraform: use this backend unless the backend configuration changes.
01:12:01.185 INFO   terraform: Initializing modules...
01:12:01.210 INFO   terraform: Downloading registry.terraform.io/terraform-aws-modules/eks/aws 21.15.1 for eks...
01:12:01.986 INFO   terraform: - eks in .terraform/modules/eks
01:12:02.000 INFO   terraform: - eks.eks_managed_node_group in .terraform/modules/eks/modules/eks-managed-node-group
01:12:02.002 INFO   terraform: - eks.eks_managed_node_group.user_data in .terraform/modules/eks/modules/_user_data
01:12:02.004 INFO   terraform: - eks.fargate_profile in .terraform/modules/eks/modules/fargate-profile
01:12:02.008 INFO   terraform: Downloading registry.terraform.io/terraform-aws-modules/kms/aws 4.0.0 for eks.kms...
01:12:02.200 INFO   terraform: - eks.kms in .terraform/modules/eks.kms
01:12:02.216 INFO   terraform: - eks.self_managed_node_group in .terraform/modules/eks/modules/self-managed-node-group
01:12:02.216 INFO   terraform: - eks.self_managed_node_group.user_data in .terraform/modules/eks/modules/_user_data
01:12:02.217 INFO   terraform: Downloading registry.terraform.io/terraform-aws-modules/eks/aws 21.15.1 for karpenter...
01:12:02.250 INFO   terraform: - karpenter in .terraform/modules/karpenter/modules/karpenter
01:12:02.260 INFO   terraform: Initializing provider plugins...
01:12:02.260 INFO   terraform: - Finding hashicorp/null versions matching ">= 3.0.0"...
01:12:02.273 INFO   terraform: - Finding hashicorp/aws versions matching ">= 6.0.0, ~> 6.0, >= 6.28.0"...
01:12:02.289 INFO   terraform: - Finding hashicorp/time versions matching ">= 0.9.0"...
01:12:02.302 INFO   terraform: - Finding hashicorp/tls versions matching ">= 4.0.0"...
01:12:02.314 INFO   terraform: - Finding hashicorp/cloudinit versions matching ">= 2.0.0"...
01:12:02.383 INFO   terraform: - Installing hashicorp/null v3.2.4...
01:12:02.632 INFO   terraform: - Installed hashicorp/null v3.2.4 (signed by HashiCorp)
01:12:02.692 INFO   terraform: - Installing hashicorp/aws v6.35.0...
01:12:10.366 INFO   terraform: - Installed hashicorp/aws v6.35.0 (signed by HashiCorp)
01:12:10.437 INFO   terraform: - Installing hashicorp/time v0.13.1...
01:12:10.678 INFO   terraform: - Installed hashicorp/time v0.13.1 (signed by HashiCorp)
01:12:10.725 INFO   terraform: - Installing hashicorp/tls v4.2.1...
01:12:11.001 INFO   terraform: - Installed hashicorp/tls v4.2.1 (signed by HashiCorp)
01:12:11.062 INFO   terraform: - Installing hashicorp/cloudinit v2.3.7...
01:12:11.311 INFO   terraform: - Installed hashicorp/cloudinit v2.3.7 (signed by HashiCorp)
01:12:11.311 INFO   terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
01:12:11.311 INFO   terraform: selections it made above. Include this file in your version control repository
01:12:11.311 INFO   terraform: so that Terraform can guarantee to make the same selections by default when
01:12:11.311 INFO   terraform: you run "terraform init" in the future.
01:12:11.312 INFO   terraform: Terraform has been successfully initialized!
01:12:11.312 INFO   terraform: You may now begin working with Terraform. Try running "terraform plan" to see
01:12:11.312 INFO   terraform: any changes that are required for your infrastructure. All Terraform commands
01:12:11.312 INFO   terraform: should now work.
01:12:11.312 INFO   terraform: If you ever set or change modules or backend configuration for Terraform,
01:12:11.312 INFO   terraform: rerun this command to reinitialize your working directory. If you forget, other
01:12:11.312 INFO   terraform: commands will detect it and remind you to do so if necessary.
01:12:18.121 STDOUT terraform: module.eks.module.eks_managed_node_group["system"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
01:12:18.122 STDOUT terraform: module.karpenter.data.aws_partition.current[0]: Reading...
01:12:18.122 STDOUT terraform: module.eks.data.aws_partition.current[0]: Reading...
01:12:18.122 STDOUT terraform: module.eks.data.aws_caller_identity.current[0]: Reading...
01:12:18.122 STDOUT terraform: module.karpenter.data.aws_service_principal.ec2[0]: Reading...
01:12:18.122 STDOUT terraform: module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Reading...
01:12:18.122 STDOUT terraform: module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
01:12:18.123 STDOUT terraform: module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0729be7f257901c49]
01:12:18.124 STDOUT terraform: aws_iam_policy.adot[0]: Refreshing state... [id=arn:aws:iam::159553542841:policy/ADOTCollectorPolicy-ml-training-secondary-us-east-1]
01:12:18.126 STDOUT terraform: module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/ml-training-secondary-us-east-1/cluster]
01:12:18.126 STDOUT terraform: module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
01:12:18.126 STDOUT terraform: module.eks.module.eks_managed_node_group["system"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
01:12:18.127 STDOUT terraform: module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Read complete after 0s [id=148955103]
01:12:18.128 STDOUT terraform: module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
01:12:18.129 STDOUT terraform: module.karpenter.data.aws_service_principal.ec2[0]: Read complete after 0s [id=ec2.us-east-1.amazonaws.com]
01:12:18.129 STDOUT terraform: module.karpenter.data.aws_partition.current[0]: Read complete after 0s [id=aws]
01:12:18.137 STDOUT terraform: module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=159553542841]
01:12:18.138 STDOUT terraform: aws_iam_policy.alb_controller: Refreshing state... [id=arn:aws:iam::159553542841:policy/ALBControllerPolicy-ml-training-secondary-us-east-1]
01:12:18.144 STDOUT terraform: module.karpenter.data.aws_region.current[0]: Reading...
01:12:18.145 STDOUT terraform: module.karpenter.data.aws_caller_identity.current[0]: Reading...
01:12:18.145 STDOUT terraform: module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
01:12:18.145 STDOUT terraform: module.eks.module.kms.data.aws_partition.current[0]: Reading...
01:12:18.151 STDOUT terraform: module.karpenter.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
01:12:18.151 STDOUT terraform: module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
01:12:18.157 STDOUT terraform: module.karpenter.aws_iam_role.controller[0]: Refreshing state... [id=KarpenterController-ml-training-secondary-us-east-1]
01:12:18.157 STDOUT terraform: module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=159553542841]
01:12:18.159 STDOUT terraform: module.eks.module.eks_managed_node_group["system"].aws_iam_role.this[0]: Refreshing state... [id=system-node-group-ml-training-secondary-us-east-1]
01:12:18.161 STDOUT terraform: module.karpenter.data.aws_caller_identity.current[0]: Read complete after 0s [id=159553542841]
01:12:18.162 STDOUT terraform: module.eks.data.aws_iam_session_context.current[0]: Reading...
01:12:18.163 STDOUT terraform: module.eks.aws_iam_role.this[0]: Refreshing state... [id=ml-training-secondary-us-east-1-cluster]
01:12:18.165 STDOUT terraform: module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Reading...
01:12:18.167 STDOUT terraform: module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0906f0b005193a3cf]
01:12:18.167 STDOUT terraform: module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Read complete after 0s [id=2560088296]
01:12:18.221 STDOUT terraform: module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::159553542841:assumed-role/TerraformExecutionRole/aws-go-sdk-1772673137963808278]
01:12:18.260 STDOUT terraform: module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=ml-training-secondary-us-east-1-cluster/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
01:12:18.265 STDOUT terraform: module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
01:12:18.268 STDOUT terraform: module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=99295490]
01:12:18.272 STDOUT terraform: module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=ca53bb21-6b2d-4ad4-9ed2-5068287880af]
01:12:18.290 STDOUT terraform: module.eks.module.eks_managed_node_group["system"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=system-node-group-ml-training-secondary-us-east-1/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
01:12:18.291 STDOUT terraform: module.eks.module.eks_managed_node_group["system"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=system-node-group-ml-training-secondary-us-east-1/arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy]
01:12:18.291 STDOUT terraform: module.eks.module.eks_managed_node_group["system"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=system-node-group-ml-training-secondary-us-east-1/arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy]
01:12:18.330 STDOUT terraform: module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/ml-training-secondary-us-east-1]
01:12:18.331 STDOUT terraform: module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::159553542841:policy/ml-training-secondary-us-east-1-cluster-ClusterEncryption20260304051133260700000003]
01:12:18.343 STDOUT terraform: module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-4048412739]
01:12:18.343 STDOUT terraform: module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3792821346]
01:12:18.343 STDOUT terraform: module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-268598135]
01:12:18.344 STDOUT terraform: module.eks.aws_security_group_rule.node["ingress_cluster_10251_webhook"]: Refreshing state... [id=sgrule-661812816]
01:12:18.344 STDOUT terraform: module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-3532874746]
01:12:18.345 STDOUT terraform: module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-940541909]
01:12:18.345 STDOUT terraform: module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-2259742633]
01:12:18.345 STDOUT terraform: module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-1694490480]
01:12:18.346 STDOUT terraform: module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-322643499]
01:12:18.418 STDOUT terraform: module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-3949832277]
01:12:18.459 STDOUT terraform: module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-395081317]
01:12:18.459 STDOUT terraform: module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-3026049176]
01:12:18.481 STDOUT terraform: module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=ml-training-secondary-us-east-1-cluster/arn:aws:iam::159553542841:policy/ml-training-secondary-us-east-1-cluster-ClusterEncryption20260304051133260700000003]
01:12:18.578 STDOUT terraform: module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=ml-training-secondary-us-east-1]
01:12:18.777 STDOUT terraform: module.eks.data.tls_certificate.this[0]: Reading...
01:12:18.778 STDOUT terraform: module.eks.time_sleep.this[0]: Refreshing state... [id=2026-03-04T05:22:47Z]
01:12:18.782 STDOUT terraform: module.karpenter.aws_cloudwatch_event_rule.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20260304052217908100000005]
01:12:18.783 STDOUT terraform: module.karpenter.aws_cloudwatch_event_rule.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20260304052217908000000004]
01:12:18.784 STDOUT terraform: module.karpenter.aws_cloudwatch_event_rule.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20260304052217908300000006]
01:12:18.788 STDOUT terraform: module.karpenter.aws_cloudwatch_event_rule.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20260304052217908300000007]
01:12:18.789 STDOUT terraform: module.karpenter.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/159553542841/Karpenter-ml-training-secondary-us-east-1]
01:12:18.790 STDOUT terraform: module.karpenter.aws_iam_role.node[0]: Refreshing state... [id=KarpenterNode-ml-training-secondary-us-east-1]
01:12:18.791 STDOUT terraform: module.karpenter.aws_eks_pod_identity_association.karpenter[0]: Refreshing state... [id=a-9rtlehpprkgempgan]
01:12:18.816 STDOUT terraform: module.eks.module.eks_managed_node_group["system"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=5205022439253973866]
01:12:18.817 STDOUT terraform: module.eks.module.eks_managed_node_group["system"].data.aws_ssm_parameter.ami[0]: Reading...
01:12:18.834 STDOUT terraform: module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=b1b539daa206035ae3c3e28288b0681fa1b462f3]
01:12:18.838 STDOUT terraform: module.eks.module.eks_managed_node_group["system"].aws_launch_template.this[0]: Refreshing state... [id=lt-01070ce583baa9ae3]
01:12:18.839 STDOUT terraform: module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::159553542841:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/28FAC1BC3DAC82FA7DFDB1CA47EBC5EC]
01:12:18.854 STDOUT terraform: module.karpenter.data.aws_iam_policy_document.queue[0]: Reading...
01:12:18.856 STDOUT terraform: module.karpenter.data.aws_iam_policy_document.queue[0]: Read complete after 0s [id=4126791983]
01:12:18.858 STDOUT terraform: module.karpenter.aws_sqs_queue_policy.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/159553542841/Karpenter-ml-training-secondary-us-east-1]
01:12:18.870 STDOUT terraform: module.eks.module.eks_managed_node_group["system"].data.aws_ssm_parameter.ami[0]: Read complete after 0s [id=/aws/service/eks/optimized-ami/1.32/amazon-linux-2023/x86_64/standard/recommended/release_version]
01:12:18.882 STDOUT terraform: data.aws_iam_policy_document.ebs_csi_trust: Reading...
01:12:18.885 STDOUT terraform: data.aws_iam_policy_document.ebs_csi_trust: Read complete after 0s [id=3537775320]
01:12:18.886 STDOUT terraform: data.aws_iam_policy_document.ray_trust[0]: Reading...
01:12:18.887 STDOUT terraform: data.aws_iam_policy_document.alb_controller_trust: Reading...
01:12:18.888 STDOUT terraform: data.aws_iam_policy_document.adot_trust[0]: Reading...
01:12:18.889 STDOUT terraform: aws_iam_role.ebs_csi: Refreshing state... [id=EBS-CSI-ml-training-secondary-us-east-1]
01:12:18.890 STDOUT terraform: data.aws_iam_policy_document.ray_trust[0]: Read complete after 0s [id=3219232077]
01:12:18.890 STDOUT terraform: data.aws_iam_policy_document.alb_controller_trust: Read complete after 0s [id=645143386]
01:12:18.892 STDOUT terraform: data.aws_iam_policy_document.adot_trust[0]: Read complete after 0s [id=990714984]
01:12:18.895 STDOUT terraform: aws_iam_role.adot[0]: Refreshing state... [id=ADOTCollector-ml-training-secondary-us-east-1]
01:12:18.895 STDOUT terraform: aws_iam_role.alb_controller: Refreshing state... [id=ALBController-ml-training-secondary-us-east-1]
01:12:18.903 STDOUT terraform: module.karpenter.aws_cloudwatch_event_target.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20260304052217908100000005-KarpenterInterruptionQueueTarget]
01:12:18.903 STDOUT terraform: module.karpenter.aws_cloudwatch_event_target.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20260304052217908000000004-KarpenterInterruptionQueueTarget]
01:12:18.909 STDOUT terraform: module.karpenter.aws_cloudwatch_event_target.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20260304052217908300000006-KarpenterInterruptionQueueTarget]
01:12:18.918 STDOUT terraform: module.karpenter.aws_cloudwatch_event_target.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20260304052217908300000007-KarpenterInterruptionQueueTarget]
01:12:18.951 STDOUT terraform: module.karpenter.aws_eks_access_entry.node[0]: Refreshing state... [id=ml-training-secondary-us-east-1:arn:aws:iam::159553542841:role/KarpenterNode-ml-training-secondary-us-east-1]
01:12:18.969 STDOUT terraform: module.karpenter.aws_iam_role_policy_attachment.node_additional["AmazonSSMManagedInstanceCore"]: Refreshing state... [id=KarpenterNode-ml-training-secondary-us-east-1/arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]
01:12:18.972 STDOUT terraform: module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=KarpenterNode-ml-training-secondary-us-east-1/arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy]
01:12:18.976 STDOUT terraform: module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKS_CNI_Policy"]: Refreshing state... [id=KarpenterNode-ml-training-secondary-us-east-1/arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy]
01:12:18.982 STDOUT terraform: module.karpenter.aws_iam_role_policy_attachment.node["AmazonEC2ContainerRegistryPullOnly"]: Refreshing state... [id=KarpenterNode-ml-training-secondary-us-east-1/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryPullOnly]
01:12:18.984 STDOUT terraform: module.karpenter.data.aws_iam_policy_document.controller[0]: Reading...
01:12:18.997 STDOUT terraform: aws_iam_role_policy_attachment.cloudwatch_agent_karpenter[0]: Refreshing state... [id=KarpenterNode-ml-training-secondary-us-east-1/arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy]
01:12:19.002 STDOUT terraform: module.karpenter.data.aws_iam_policy_document.controller[0]: Read complete after 0s [id=1398086839]
01:12:19.005 STDOUT terraform: aws_iam_role_policy_attachment.alb_controller: Refreshing state... [id=ALBController-ml-training-secondary-us-east-1/arn:aws:iam::159553542841:policy/ALBControllerPolicy-ml-training-secondary-us-east-1]
01:12:19.006 STDOUT terraform: aws_iam_role_policy_attachment.adot[0]: Refreshing state... [id=ADOTCollector-ml-training-secondary-us-east-1/arn:aws:iam::159553542841:policy/ADOTCollectorPolicy-ml-training-secondary-us-east-1]
01:12:19.012 STDOUT terraform: module.eks.module.eks_managed_node_group["system"].aws_eks_node_group.this[0]: Refreshing state... [id=ml-training-secondary-us-east-1:system]
01:12:19.013 STDOUT terraform: module.karpenter.aws_iam_policy.controller[0]: Refreshing state... [id=arn:aws:iam::159553542841:policy/KarpenterController-ml-training-secondary-us-east-1]
01:12:19.070 STDOUT terraform: aws_iam_role_policy_attachment.ebs_csi: Refreshing state... [id=EBS-CSI-ml-training-secondary-us-east-1/arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy]
01:12:19.075 STDOUT terraform: module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Reading...
01:12:19.076 STDOUT terraform: module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
01:12:19.076 STDOUT terraform: module.eks.data.aws_eks_addon_version.this["amazon-sagemaker-hyperpod-taskgovernance"]: Reading...
01:12:19.076 STDOUT terraform: module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Reading...
01:12:19.076 STDOUT terraform: module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
01:12:19.077 STDOUT terraform: module.eks.data.aws_eks_addon_version.this["amazon-cloudwatch-observability"]: Reading...
01:12:19.108 STDOUT terraform: module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
01:12:19.112 STDOUT terraform: module.karpenter.aws_iam_role_policy_attachment.controller[0]: Refreshing state... [id=KarpenterController-ml-training-secondary-us-east-1/arn:aws:iam::159553542841:policy/KarpenterController-ml-training-secondary-us-east-1]
01:12:19.161 STDOUT terraform: aws_iam_role_policy_attachment.cloudwatch_agent_system[0]: Refreshing state... [id=system-node-group-ml-training-secondary-us-east-1/arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy]
01:12:19.214 STDOUT terraform: module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Read complete after 0s [id=aws-ebs-csi-driver]
01:12:19.223 STDOUT terraform: module.eks.data.aws_eks_addon_version.this["amazon-sagemaker-hyperpod-taskgovernance"]: Read complete after 0s [id=amazon-sagemaker-hyperpod-taskgovernance]
01:12:19.238 STDOUT terraform: module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Read complete after 0s [id=eks-pod-identity-agent]
01:12:19.241 STDOUT terraform: module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
01:12:19.243 STDOUT terraform: module.eks.data.aws_eks_addon_version.this["amazon-cloudwatch-observability"]: Read complete after 0s [id=amazon-cloudwatch-observability]
01:12:19.244 STDOUT terraform: module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
01:12:19.258 STDOUT terraform: module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
01:12:19.263 STDOUT terraform: module.eks.aws_eks_addon.before_compute["vpc-cni"]: Refreshing state... [id=ml-training-secondary-us-east-1:vpc-cni]
01:12:19.264 STDOUT terraform: module.eks.aws_eks_addon.this["amazon-sagemaker-hyperpod-taskgovernance"]: Refreshing state... [id=ml-training-secondary-us-east-1:amazon-sagemaker-hyperpod-taskgovernance]
01:12:19.265 STDOUT terraform: module.eks.aws_eks_addon.before_compute["eks-pod-identity-agent"]: Refreshing state... [id=ml-training-secondary-us-east-1:eks-pod-identity-agent]
01:12:19.265 STDOUT terraform: module.eks.aws_eks_addon.before_compute["aws-ebs-csi-driver"]: Refreshing state... [id=ml-training-secondary-us-east-1:aws-ebs-csi-driver]
01:12:19.265 STDOUT terraform: module.eks.aws_eks_addon.this["amazon-cloudwatch-observability"]: Refreshing state... [id=ml-training-secondary-us-east-1:amazon-cloudwatch-observability]
01:12:19.266 STDOUT terraform: module.eks.aws_eks_addon.before_compute["kube-proxy"]: Refreshing state... [id=ml-training-secondary-us-east-1:kube-proxy]
01:12:19.267 STDOUT terraform: module.eks.aws_eks_addon.before_compute["coredns"]: Refreshing state... [id=ml-training-secondary-us-east-1:coredns]
01:12:19.942 STDOUT terraform: Terraform used the selected providers to generate the following execution
01:12:19.942 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
01:12:19.942 STDOUT terraform:   + create
01:12:19.942 STDOUT terraform: Terraform will perform the following actions:
01:12:19.942 STDOUT terraform:   # aws_eks_access_entry.argocd["arn:aws:iam::159553542841:role/mock"] will be created
01:12:19.942 STDOUT terraform:   + resource "aws_eks_access_entry" "argocd" {
01:12:19.942 STDOUT terraform:       + access_entry_arn  = (known after apply)
01:12:19.942 STDOUT terraform:       + cluster_name      = "ml-training-secondary-us-east-1"
01:12:19.942 STDOUT terraform:       + created_at        = (known after apply)
01:12:19.942 STDOUT terraform:       + id                = (known after apply)
01:12:19.942 STDOUT terraform:       + kubernetes_groups = (known after apply)
01:12:19.942 STDOUT terraform:       + modified_at       = (known after apply)
01:12:19.942 STDOUT terraform:       + principal_arn     = "arn:aws:iam::159553542841:role/mock"
01:12:19.942 STDOUT terraform:       + region            = "us-east-1"
01:12:19.942 STDOUT terraform:       + tags_all          = {
01:12:19.942 STDOUT terraform:           + "Account"    = "secondary"
01:12:19.942 STDOUT terraform:           + "ManagedBy"  = "terraform"
01:12:19.943 STDOUT terraform:           + "Region"     = "us-east-1"
01:12:19.943 STDOUT terraform:           + "Repository" = "ml-clusters"
01:12:19.943 STDOUT terraform:         }
01:12:19.943 STDOUT terraform:       + type              = "STANDARD"
01:12:19.943 STDOUT terraform:       + user_name         = (known after apply)
01:12:19.943 STDOUT terraform:     }
01:12:19.943 STDOUT terraform:   # aws_eks_access_policy_association.argocd["arn:aws:iam::159553542841:role/mock"] will be created
01:12:19.943 STDOUT terraform:   + resource "aws_eks_access_policy_association" "argocd" {
01:12:19.943 STDOUT terraform:       + associated_at = (known after apply)
01:12:19.943 STDOUT terraform:       + cluster_name  = "ml-training-secondary-us-east-1"
01:12:19.943 STDOUT terraform:       + id            = (known after apply)
01:12:19.943 STDOUT terraform:       + modified_at   = (known after apply)
01:12:19.943 STDOUT terraform:       + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
01:12:19.943 STDOUT terraform:       + principal_arn = "arn:aws:iam::159553542841:role/mock"
01:12:19.943 STDOUT terraform:       + region        = "us-east-1"
01:12:19.943 STDOUT terraform:       + access_scope {
01:12:19.943 STDOUT terraform:           + type = "cluster"
01:12:19.943 STDOUT terraform:         }
01:12:19.943 STDOUT terraform:     }
01:12:19.943 STDOUT terraform:   # aws_iam_policy.ray[0] will be created
01:12:19.943 STDOUT terraform:   + resource "aws_iam_policy" "ray" {
01:12:19.943 STDOUT terraform:       + arn              = (known after apply)
01:12:19.943 STDOUT terraform:       + attachment_count = (known after apply)
01:12:19.943 STDOUT terraform:       + id               = (known after apply)
01:12:19.944 STDOUT terraform:       + name             = "RayClusterPolicy-ml-training-secondary-us-east-1"
01:12:19.944 STDOUT terraform:       + name_prefix      = (known after apply)
01:12:19.944 STDOUT terraform:       + path             = "/"
01:12:19.944 STDOUT terraform:       + policy           = jsonencode(
01:12:19.944 STDOUT terraform:             {
01:12:19.944 STDOUT terraform:               + Statement = [
01:12:19.944 STDOUT terraform:                   + {
01:12:19.944 STDOUT terraform:                       + Action   = [
01:12:19.944 STDOUT terraform:                           + "s3:GetObject",
01:12:19.944 STDOUT terraform:                           + "s3:PutObject",
01:12:19.944 STDOUT terraform:                           + "s3:DeleteObject",
01:12:19.944 STDOUT terraform:                         ]
01:12:19.944 STDOUT terraform:                       + Effect   = "Allow"
01:12:19.944 STDOUT terraform:                       + Resource = [
01:12:19.944 STDOUT terraform:                           + "arn:aws:s3:::ml-data-replica-159553542841-us-east-1/*",
01:12:19.944 STDOUT terraform:                         ]
01:12:19.944 STDOUT terraform:                     },
01:12:19.944 STDOUT terraform:                   + {
01:12:19.944 STDOUT terraform:                       + Action   = [
01:12:19.944 STDOUT terraform:                           + "s3:ListBucket",
01:12:19.944 STDOUT terraform:                         ]
01:12:19.944 STDOUT terraform:                       + Effect   = "Allow"
01:12:19.944 STDOUT terraform:                       + Resource = [
01:12:19.944 STDOUT terraform:                           + "arn:aws:s3:::ml-data-replica-159553542841-us-east-1",
01:12:19.944 STDOUT terraform:                         ]
01:12:19.944 STDOUT terraform:                     },
01:12:19.944 STDOUT terraform:                 ]
01:12:19.944 STDOUT terraform:               + Version   = "2012-10-17"
01:12:19.944 STDOUT terraform:             }
01:12:19.944 STDOUT terraform:         )
01:12:19.944 STDOUT terraform:       + policy_id        = (known after apply)
01:12:19.945 STDOUT terraform:       + tags_all         = {
01:12:19.945 STDOUT terraform:           + "Account"    = "secondary"
01:12:19.945 STDOUT terraform:           + "ManagedBy"  = "terraform"
01:12:19.945 STDOUT terraform:           + "Region"     = "us-east-1"
01:12:19.945 STDOUT terraform:           + "Repository" = "ml-clusters"
01:12:19.945 STDOUT terraform:         }
01:12:19.945 STDOUT terraform:     }
01:12:19.945 STDOUT terraform:   # aws_iam_role.ray[0] will be created
01:12:19.945 STDOUT terraform:   + resource "aws_iam_role" "ray" {
01:12:19.945 STDOUT terraform:       + arn                   = (known after apply)
01:12:19.945 STDOUT terraform:       + assume_role_policy    = jsonencode(
01:12:19.945 STDOUT terraform:             {
01:12:19.945 STDOUT terraform:               + Statement = [
01:12:19.945 STDOUT terraform:                   + {
01:12:19.945 STDOUT terraform:                       + Action    = "sts:AssumeRoleWithWebIdentity"
01:12:19.945 STDOUT terraform:                       + Condition = {
01:12:19.945 STDOUT terraform:                           + StringEquals = {
01:12:19.945 STDOUT terraform:                               + "oidc.eks.us-east-1.amazonaws.com/id/28FAC1BC3DAC82FA7DFDB1CA47EBC5EC:aud" = "sts.amazonaws.com"
01:12:19.945 STDOUT terraform:                               + "oidc.eks.us-east-1.amazonaws.com/id/28FAC1BC3DAC82FA7DFDB1CA47EBC5EC:sub" = "system:serviceaccount:kuberay:ray-cluster"
01:12:19.945 STDOUT terraform:                             }
01:12:19.945 STDOUT terraform:                         }
01:12:19.945 STDOUT terraform:                       + Effect    = "Allow"
01:12:19.945 STDOUT terraform:                       + Principal = {
01:12:19.945 STDOUT terraform:                           + Federated = "arn:aws:iam::159553542841:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/28FAC1BC3DAC82FA7DFDB1CA47EBC5EC"
01:12:19.945 STDOUT terraform:                         }
01:12:19.946 STDOUT terraform:                     },
01:12:19.946 STDOUT terraform:                 ]
01:12:19.946 STDOUT terraform:               + Version   = "2012-10-17"
01:12:19.946 STDOUT terraform:             }
01:12:19.946 STDOUT terraform:         )
01:12:19.946 STDOUT terraform:       + create_date           = (known after apply)
01:12:19.946 STDOUT terraform:       + force_detach_policies = false
01:12:19.946 STDOUT terraform:       + id                    = (known after apply)
01:12:19.946 STDOUT terraform:       + managed_policy_arns   = (known after apply)
01:12:19.946 STDOUT terraform:       + max_session_duration  = 3600
01:12:19.946 STDOUT terraform:       + name                  = "RayCluster-ml-training-secondary-us-east-1"
01:12:19.946 STDOUT terraform:       + name_prefix           = (known after apply)
01:12:19.946 STDOUT terraform:       + path                  = "/"
01:12:19.946 STDOUT terraform:       + tags_all              = {
01:12:19.946 STDOUT terraform:           + "Account"    = "secondary"
01:12:19.946 STDOUT terraform:           + "ManagedBy"  = "terraform"
01:12:19.946 STDOUT terraform:           + "Region"     = "us-east-1"
01:12:19.946 STDOUT terraform:           + "Repository" = "ml-clusters"
01:12:19.946 STDOUT terraform:         }
01:12:19.946 STDOUT terraform:       + unique_id             = (known after apply)
01:12:19.946 STDOUT terraform:       + inline_policy (known after apply)
01:12:19.946 STDOUT terraform:     }
01:12:19.946 STDOUT terraform:   # aws_iam_role_policy_attachment.ray[0] will be created
01:12:19.946 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "ray" {
01:12:19.946 STDOUT terraform:       + id         = (known after apply)
01:12:19.946 STDOUT terraform:       + policy_arn = (known after apply)
01:12:19.946 STDOUT terraform:       + role       = "RayCluster-ml-training-secondary-us-east-1"
01:12:19.946 STDOUT terraform:     }
01:12:19.946 STDOUT terraform: Plan: 5 to add, 0 to change, 0 to destroy.
01:12:19.946 STDOUT terraform: Changes to Outputs:
01:12:19.946 STDOUT terraform:   + ray_role_arn                       = (known after apply)
01:12:19.946 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
01:12:19.947 STDOUT terraform: Saved the plan to:
01:12:19.947 STDOUT terraform: ./secondary-us-east-1-eks-cluster-default.tfplan
01:12:19.947 STDOUT terraform: To perform exactly these actions, run the following command to apply:
01:12:19.947 STDOUT terraform:     terraform apply "./secondary-us-east-1-eks-cluster-default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p secondary-us-east-1-eks-cluster
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.mlkeita.people.aws.dev/lock?id=KeitaW%252Fml-clusters%252Flive%252Fsecondary-account%252Fus-east-1%252Feks-cluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p secondary-us-east-1-eks-cluster
  ```
Plan: 5 to add, 0 to change, 0 to destroy.

---
### 3. project: `main-us-east-1-argocd` dir: `live/main-account/us-east-1/argocd` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/extra-bin/terragrunt plan -no-color -out=$PLANFILE' in '/atlantis-data/repos/KeitaW/ml-clusters/21/default/live/main-account/us-east-1/argocd': exit status 1: running "/extra-bin/terragrunt plan -no-color -out=$PLANFILE" in "/atlantis-data/repos/KeitaW/ml-clusters/21/default/live/main-account/us-east-1/argocd": 
01:12:20.736 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
01:13:02.653 INFO   Downloading Terraform configurations from ../../../../modules/argocd into ./.terragrunt-cache/2rAzgkZiY18AYfgtJpTBnj3rtig/Tp0A-X_9Fp8E-ySKSZi68josZWU
01:13:02.687 INFO   terraform: Initializing the backend...
01:13:02.788 INFO   terraform: Successfully configured the backend "s3"! Terraform will automatically
01:13:02.788 INFO   terraform: use this backend unless the backend configuration changes.
01:13:02.917 INFO   terraform: Initializing provider plugins...
01:13:02.917 INFO   terraform: - Finding hashicorp/helm versions matching ">= 2.0.0"...
01:13:02.942 INFO   terraform: - Finding hashicorp/kubernetes versions matching ">= 2.0.0"...
01:13:02.955 INFO   terraform: - Finding hashicorp/aws versions matching "~> 6.0"...
01:13:03.027 INFO   terraform: - Installing hashicorp/kubernetes v3.0.1...
01:13:03.821 INFO   terraform: - Installed hashicorp/kubernetes v3.0.1 (signed by HashiCorp)
01:13:03.892 INFO   terraform: - Installing hashicorp/aws v6.35.0...
01:13:11.501 INFO   terraform: - Installed hashicorp/aws v6.35.0 (signed by HashiCorp)
01:13:11.557 INFO   terraform: - Installing hashicorp/helm v3.1.1...
01:13:12.355 INFO   terraform: - Installed hashicorp/helm v3.1.1 (signed by HashiCorp)
01:13:12.355 INFO   terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
01:13:12.355 INFO   terraform: selections it made above. Include this file in your version control repository
01:13:12.355 INFO   terraform: so that Terraform can guarantee to make the same selections by default when
01:13:12.355 INFO   terraform: you run "terraform init" in the future.
01:13:12.356 INFO   terraform: Terraform has been successfully initialized!
01:13:12.356 INFO   terraform: You may now begin working with Terraform. Try running "terraform plan" to see
01:13:12.356 INFO   terraform: any changes that are required for your infrastructure. All Terraform commands
01:13:12.356 INFO   terraform: should now work.
01:13:12.356 INFO   terraform: If you ever set or change modules or backend configuration for Terraform,
01:13:12.356 INFO   terraform: rerun this command to reinitialize your working directory. If you forget, other
01:13:12.356 INFO   terraform: commands will detect it and remind you to do so if necessary.
01:13:18.411 STDOUT terraform: kubernetes_namespace_v1.argocd: Refreshing state... [id=argocd]
01:13:18.528 STDOUT terraform: data.aws_iam_policy_document.argocd_controller_permissions: Reading...
01:13:18.528 STDOUT terraform: data.aws_iam_policy_document.argocd_controller_trust: Reading...
01:13:18.530 STDOUT terraform: data.aws_iam_policy_document.argocd_controller_permissions: Read complete after 0s [id=1353839944]
01:13:18.531 STDOUT terraform: data.aws_iam_policy_document.argocd_controller_trust: Read complete after 0s [id=2171699374]
01:13:18.533 STDOUT terraform: aws_iam_policy.argocd_controller: Refreshing state... [id=arn:aws:iam::483026362307:policy/ArgoCD-Hub-Controller-Policy]
01:13:18.533 STDOUT terraform: aws_iam_role.argocd_controller: Refreshing state... [id=ArgoCD-Hub-Controller]
01:13:18.629 STDOUT terraform: aws_iam_role_policy_attachment.argocd_controller: Refreshing state... [id=ArgoCD-Hub-Controller/arn:aws:iam::483026362307:policy/ArgoCD-Hub-Controller-Policy]
01:13:18.849 STDOUT terraform: Planning failed. Terraform encountered an error while generating this plan.
01:13:18.851 STDERR terraform: Error: Get "https://8F9E481B10F82905056475D2895E5B04.gr7.us-east-1.eks.amazonaws.com/api/v1/namespaces/argocd": getting credentials: exec: executable aws not found
01:13:18.851 STDERR terraform: It looks like you are trying to use a client-go credential plugin that is not installed.
01:13:18.852 STDERR terraform: To learn more about this feature, consult the documentation available at:
01:13:18.852 STDERR terraform:       https://kubernetes.io/docs/reference/access-authn-authz/authentication/#client-go-credential-plugins
01:13:18.852 STDERR terraform:   with kubernetes_namespace_v1.argocd,
01:13:18.852 STDERR terraform:   on main.tf line 98, in resource "kubernetes_namespace_v1" "argocd":
01:13:18.852 STDERR terraform:   98: resource "kubernetes_namespace_v1" "argocd" {
01:13:18.911 ERROR  error occurred:

* Failed to execute "terraform plan -out=./main-us-east-1-argocd-default.tfplan -no-color" in ./.terragrunt-cache/2rAzgkZiY18AYfgtJpTBnj3rtig/Tp0A-X_9Fp8E-ySKSZi68josZWU
  
  Error: Get "https://8F9E481B10F82905056475D2895E5B04.gr7.us-east-1.eks.amazonaws.com/api/v1/namespaces/argocd": getting credentials: exec: executable aws not found
  
  It looks like you are trying to use a client-go credential plugin that is not installed.
  
  To learn more about this feature, consult the documentation available at:
        https://kubernetes.io/docs/reference/access-authn-authz/authentication/#client-go-credential-plugins
  
    with kubernetes_namespace_v1.argocd,
    on main.tf line 98, in resource "kubernetes_namespace_v1" "argocd":
    98: resource "kubernetes_namespace_v1" "argocd" {
  
  
  exit status 1



```
</details>

---
### Plan Summary

3 projects, 2 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```